quantum_continuum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-07 Fri 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Quantum and Continuum Mechanics Notes</title>
<meta name="author" content="Akash Gopinath" />
<meta name="description" content="Quantum and Continuum Mechanics Notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Quantum and Continuum Mechanics Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12fe376">Prerequisites</a></li>
<li><a href="#orgea5e1fb">Structure</a></li>
<li><a href="#orgd384c4a">Notes</a>
<ul>
<li><a href="#org37108e7">Continuum Mechanics</a></li>
<li><a href="#org5b66b21">Quantum Mechanics</a></li>
</ul>
</li>
<li><a href="#org89ebab0">TODO</a></li>
</ul>
</div>
</div>

<div id="outline-container-org12fe376" class="outline-2">
<h2 id="org12fe376">Prerequisites</h2>
<div class="outline-text-2" id="text-org12fe376">
<p>
It is recommend to have a course on Vector and Complex Calculus, Multi-variable Calculus, Differential Equations and Fourier Series
</p>
</div>
</div>

<div id="outline-container-orgea5e1fb" class="outline-2">
<h2 id="orgea5e1fb">Structure</h2>
<div class="outline-text-2" id="text-orgea5e1fb">
<p>
This course is split into 3 parts
</p>

<ol class="org-ol">
<li>Continuum (Wave) Mechanics</li>
<li>Quantum Mechanics</li>
<li>Fluid Mechanics</li>
</ol>
</div>
</div>

<div id="outline-container-orgd384c4a" class="outline-2">
<h2 id="orgd384c4a">Notes</h2>
<div class="outline-text-2" id="text-orgd384c4a">
</div>
<div id="outline-container-org37108e7" class="outline-3">
<h3 id="org37108e7">Continuum Mechanics</h3>
<div class="outline-text-3" id="text-org37108e7">
<ul class="org-ul">
<li><a href="./Quantum &amp; Continuum Dynamics/Wave Mechanics.pdf">Wave Mechanics</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5b66b21" class="outline-3">
<h3 id="org5b66b21">Quantum Mechanics</h3>
<div class="outline-text-3" id="text-org5b66b21">
<ul class="org-ul">
<li><a href="./Quantum &amp; Continuum Dynamics/Quantum Mechanics.pdf">Quantum Mechanics</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org89ebab0" class="outline-2">
<h2 id="org89ebab0">TODO</h2>
<div class="outline-text-2" id="text-org89ebab0">
<ul class="org-ul">
<li>Polish Wave Mechanics notes</li>
<li>Add a part on 2D Hydrogen Atom</li>
<li>Add Fluid Mechanics Notes</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akash Gopinath</p>
<p class="date">Created: 2024-06-07 Fri 18:27</p>
</div>
</body>
</html>
